In [2]:
import numpy as np
np.linspace(1, 5, num=10)

array([1.        , 1.44444444, 1.88888889, 2.33333333, 2.77777778,
       3.22222222, 3.66666667, 4.11111111, 4.55555556, 5.        ])

In [5]:
np.logspace(3, 4, num=2)

array([ 1000., 10000.])

In [8]:
import pandas as pd
cols=['name','age','rank']
df=pd.DataFrame([["ram",20,33],["sumit",22,23],["sayan",18,13],["sougata",20,154],["sam",23,26]],columns=cols)
df

      name  age  rank
0      ram   20    33
1    sumit   22    23
2    sayan   18    13
3  sougata   20   154
4      sam   23    26

In [9]:
df[df.age<20][["name","age"]]

    name  age
2  sayan   18